k6/results/read-1m.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/read.js
        output: -

     scenarios: (100.00%) 2 scenarios, 4000 max VUs, 1m0s max duration (incl. graceful stop):
              * rank: 5000.00 iterations/s for 30s (maxVUs: 300-2000, exec: rank, gracefulStop: 30s)
              * top: 5000.00 iterations/s for 30s (maxVUs: 300-2000, exec: top, gracefulStop: 30s)


running (0m01.0s), 0019/0606 VUs, 9517 complete and 0 interrupted iterations
rank   [   3% ] 0009/0303 VUs  01.0s/30s  5000.00 iters/s
top    [   3% ] 0010/0303 VUs  01.0s/30s  5000.00 iters/s

running (0m02.0s), 0014/0606 VUs, 19516 complete and 0 interrupted iterations
rank   [   7% ] 0010/0303 VUs  02.0s/30s  5000.00 iters/s
top    [   7% ] 0005/0303 VUs  02.0s/30s  5000.00 iters/s

running (0m03.0s), 0011/0606 VUs, 29525 complete and 0 interrupted iterations
rank   [  10% ] 0006/0303 VUs  03.0s/30s  5000.00 iters/s
top    [  10% ] 0007/0303 VUs  03.0s/30s  5000.00 iters/s

running (0m04.0s), 0024/0606 VUs, 39513 complete and 0 interrupted iterations
rank   [  13% ] 0014/0303 VUs  04.0s/30s  5000.00 iters/s
top    [  13% ] 0010/0303 VUs  04.0s/30s  5000.00 iters/s

running (0m05.0s), 0019/0606 VUs, 49515 complete and 0 interrupted iterations
rank   [  17% ] 0011/0303 VUs  05.0s/30s  5000.00 iters/s
top    [  17% ] 0010/0303 VUs  05.0s/30s  5000.00 iters/s

running (0m06.0s), 0014/0606 VUs, 59531 complete and 0 interrupted iterations
rank   [  20% ] 0006/0303 VUs  06.0s/30s  5000.00 iters/s
top    [  20% ] 0006/0303 VUs  06.0s/30s  5000.00 iters/s

running (0m07.0s), 0014/0606 VUs, 69521 complete and 0 interrupted iterations
rank   [  23% ] 0007/0303 VUs  07.0s/30s  5000.00 iters/s
top    [  23% ] 0006/0303 VUs  07.0s/30s  5000.00 iters/s

running (0m08.0s), 0016/0606 VUs, 79516 complete and 0 interrupted iterations
rank   [  27% ] 0008/0303 VUs  08.0s/30s  5000.00 iters/s
top    [  27% ] 0007/0303 VUs  08.0s/30s  5000.00 iters/s

running (0m09.0s), 0016/0606 VUs, 89519 complete and 0 interrupted iterations
rank   [  30% ] 0007/0303 VUs  09.0s/30s  5000.00 iters/s
top    [  30% ] 0009/0303 VUs  09.0s/30s  5000.00 iters/s

running (0m10.0s), 0011/0606 VUs, 99520 complete and 0 interrupted iterations
rank   [  33% ] 0007/0303 VUs  10.0s/30s  5000.00 iters/s
top    [  33% ] 0004/0303 VUs  10.0s/30s  5000.00 iters/s

running (0m11.0s), 0014/0606 VUs, 109520 complete and 0 interrupted iterations
rank   [  37% ] 0007/0303 VUs  11.0s/30s  5000.00 iters/s
top    [  37% ] 0008/0303 VUs  11.0s/30s  5000.00 iters/s

running (0m12.0s), 0019/0606 VUs, 119517 complete and 0 interrupted iterations
rank   [  40% ] 0010/0303 VUs  12.0s/30s  5000.00 iters/s
top    [  40% ] 0010/0303 VUs  12.0s/30s  5000.00 iters/s

running (0m13.0s), 0045/0606 VUs, 129486 complete and 0 interrupted iterations
rank   [  43% ] 0028/0303 VUs  13.0s/30s  5000.00 iters/s
top    [  43% ] 0016/0303 VUs  13.0s/30s  5000.00 iters/s

running (0m14.0s), 0017/0606 VUs, 139514 complete and 0 interrupted iterations
rank   [  47% ] 0011/0303 VUs  14.0s/30s  5000.00 iters/s
top    [  47% ] 0007/0303 VUs  14.0s/30s  5000.00 iters/s

running (0m15.0s), 0015/0606 VUs, 149521 complete and 0 interrupted iterations
rank   [  50% ] 0007/0303 VUs  15.0s/30s  5000.00 iters/s
top    [  50% ] 0008/0303 VUs  15.0s/30s  5000.00 iters/s

running (0m16.0s), 0027/0606 VUs, 159506 complete and 0 interrupted iterations
rank   [  53% ] 0014/0303 VUs  16.0s/30s  5000.00 iters/s
top    [  53% ] 0014/0303 VUs  16.0s/30s  5000.00 iters/s

running (0m17.0s), 0047/0606 VUs, 169490 complete and 0 interrupted iterations
rank   [  57% ] 0023/0303 VUs  17.0s/30s  5000.00 iters/s
top    [  57% ] 0022/0303 VUs  17.0s/30s  5000.00 iters/s

running (0m18.0s), 0011/0606 VUs, 179524 complete and 0 interrupted iterations
rank   [  60% ] 0006/0303 VUs  18.0s/30s  5000.00 iters/s
top    [  60% ] 0006/0303 VUs  18.0s/30s  5000.00 iters/s

running (0m19.0s), 0016/0606 VUs, 189517 complete and 0 interrupted iterations
rank   [  63% ] 0010/0303 VUs  19.0s/30s  5000.00 iters/s
top    [  63% ] 0006/0303 VUs  19.0s/30s  5000.00 iters/s

running (0m20.0s), 0016/0606 VUs, 199521 complete and 0 interrupted iterations
rank   [  67% ] 0007/0303 VUs  20.0s/30s  5000.00 iters/s
top    [  67% ] 0009/0303 VUs  20.0s/30s  5000.00 iters/s

running (0m21.0s), 0018/0606 VUs, 209517 complete and 0 interrupted iterations
rank   [  70% ] 0009/0303 VUs  21.0s/30s  5000.00 iters/s
top    [  70% ] 0009/0303 VUs  21.0s/30s  5000.00 iters/s

running (0m22.0s), 0015/0606 VUs, 219519 complete and 0 interrupted iterations
rank   [  73% ] 0006/0303 VUs  22.0s/30s  5000.00 iters/s
top    [  73% ] 0009/0303 VUs  22.0s/30s  5000.00 iters/s

running (0m23.0s), 0025/0606 VUs, 229509 complete and 0 interrupted iterations
rank   [  77% ] 0014/0303 VUs  23.0s/30s  5000.00 iters/s
top    [  77% ] 0012/0303 VUs  23.0s/30s  5000.00 iters/s

running (0m24.0s), 0054/0629 VUs, 239139 complete and 0 interrupted iterations
rank   [  80% ] 0028/0314 VUs  24.0s/30s  5000.00 iters/s
top    [  80% ] 0026/0315 VUs  24.0s/30s  5000.00 iters/s

running (0m25.0s), 0010/0629 VUs, 249187 complete and 0 interrupted iterations
rank   [  83% ] 0005/0314 VUs  25.0s/30s  5000.00 iters/s
top    [  83% ] 0005/0315 VUs  25.0s/30s  5000.00 iters/s

running (0m26.0s), 0020/0673 VUs, 258718 complete and 0 interrupted iterations
rank   [  87% ] 0013/0337 VUs  26.0s/30s  5000.00 iters/s
top    [  87% ] 0009/0336 VUs  26.0s/30s  5000.00 iters/s

running (0m27.0s), 0019/0673 VUs, 268722 complete and 0 interrupted iterations
rank   [  90% ] 0010/0337 VUs  27.0s/30s  5000.00 iters/s
top    [  90% ] 0009/0336 VUs  27.0s/30s  5000.00 iters/s

running (0m28.0s), 0022/0673 VUs, 278718 complete and 0 interrupted iterations
rank   [  93% ] 0011/0337 VUs  28.0s/30s  5000.00 iters/s
top    [  93% ] 0012/0336 VUs  28.0s/30s  5000.00 iters/s

running (0m29.0s), 0017/0673 VUs, 288724 complete and 0 interrupted iterations
rank   [  97% ] 0008/0337 VUs  29.0s/30s  5000.00 iters/s
top    [  97% ] 0009/0336 VUs  29.0s/30s  5000.00 iters/s

running (0m30.0s), 0020/0673 VUs, 298722 complete and 0 interrupted iterations
rank   [ 100% ] 0010/0337 VUs  30.0s/30s  5000.00 iters/s
top    [ 100% ] 0010/0336 VUs  30.0s/30s  5000.00 iters/s

     ✓ top 200
     ✓ rank 200/404

     checks.............................: 100.00% 299086 out of 299086
     data_received......................: 915 MB  31 MB/s
     data_sent..........................: 36 MB   1.2 MB/s
     dropped_iterations.................: 914     30.465302/s
     http_req_blocked...................: avg=47.25µs med=1.41µs  p(95)=3.25µs  p(99)=14.04µs  max=71.41ms 
     http_req_connecting................: avg=42.83µs med=0s      p(95)=0s      p(99)=0s       max=49.43ms 
   ✓ http_req_duration..................: avg=2.57ms  med=1.57ms  p(95)=5.26ms  p(99)=21.54ms  max=114.7ms 
       { expected_response:true }.......: avg=2.57ms  med=1.57ms  p(95)=5.26ms  p(99)=21.54ms  max=114.7ms 
     ✓ { name:GET /leaderboard/rank }...: avg=2.63ms  med=1.62ms  p(95)=5.38ms  p(99)=21.85ms  max=113.68ms
     ✓ { name:GET /leaderboard/top }....: avg=2.52ms  med=1.53ms  p(95)=5.17ms  p(99)=21.12ms  max=114.7ms 
     ✓ { name:POST /score }.............: avg=0s      med=0s      p(95)=0s      p(99)=0s       max=0s      
   ✓ http_req_failed....................: 0.00%   0 out of 299086
     http_req_receiving.................: avg=22.15µs med=12.62µs p(95)=66.83µs p(99)=143.75µs max=11.06ms 
     http_req_sending...................: avg=12.4µs  med=3.12µs  p(95)=40.58µs p(99)=132.79µs max=24.6ms  
     http_req_tls_handshaking...........: avg=0s      med=0s      p(95)=0s      p(99)=0s       max=0s      
     http_req_waiting...................: avg=2.54ms  med=1.55ms  p(95)=5.21ms  p(99)=21.46ms  max=114.63ms
     http_reqs..........................: 299086  9969.086621/s
     iteration_duration.................: avg=2.67ms  med=1.62ms  p(95)=5.34ms  p(99)=23.43ms  max=148.55ms
     iterations.........................: 299086  9969.086621/s
     vus................................: 20      min=10               max=56 
     vus_max............................: 673     min=606              max=673


running (0m30.0s), 0000/0673 VUs, 299086 complete and 0 interrupted iterations
rank ✓ [ 100% ] 0000/0337 VUs  30s  5000.00 iters/s
top  ✓ [ 100% ] 0000/0336 VUs  30s  5000.00 iters/s